## :x: Apply Result





<pre><code>Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34;:
   3: resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.google_client_config.gcp: Reading...
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=5e665b7758004bfcd801b09dd2fa7c23fcca9d46e860397abc2aac2e213deb16]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostnamespace\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Namespace\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Disallows sharing of host PID and IPC namespaces by pod containers.\n      Corresponds to the `hostPID` and `hostIPC` fields in a PodSecurityPolicy.\n      For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostNamespace\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Disallows sharing of host PID and IPC namespaces by pod containers.\n            Corresponds to the `hostPID` and `hostIPC` fields in a PodSecurityPolicy.\n            For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostnamespace\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            input_share_hostnamespace(input.review.object)\n            msg := sprintf(\"Sharing the host namespace is not allowed: %v\", [input.review.object.metadata.name])\n        }\n\n        input_share_hostnamespace(o) {\n            o.spec.hostPID\n        }\n        input_share_hostnamespace(o) {\n            o.spec.hostIPC\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostnamespace]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspprivilegedcontainer]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspapparmor\n  annotations:\n    metadata.gatekeeper.sh/title: \"App Armor\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Configures an allow-list of AppArmor profiles for use by containers.\n      This corresponds to specific annotations applied to a PodSecurityPolicy.\n      For information on AppArmor, see\n      https://kubernetes.io/docs/tutorials/clusters/apparmor/\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAppArmor\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Configures an allow-list of AppArmor profiles for use by containers.\n            This corresponds to specific annotations applied to a PodSecurityPolicy.\n            For information on AppArmor, see\n            https://kubernetes.io/docs/tutorials/clusters/apparmor/\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            allowedProfiles:\n              description: \"An array of AppArmor profiles. Examples: `runtime/default`, `unconfined`.\"\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspapparmor\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            metadata := input.review.object.metadata\n            container := input_containers[_]\n            not is_exempt(container)\n            not input_apparmor_allowed(container, metadata)\n            msg := sprintf(\"AppArmor profile is not allowed, pod: %v, container: %v. Allowed profiles: %v\", [input.review.object.metadata.name, container.name, input.parameters.allowedProfiles])\n        }\n\n        input_apparmor_allowed(container, metadata) {\n            get_annotation_for(container, metadata) == input.parameters.allowedProfiles[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n\n        get_annotation_for(container, metadata) = out {\n            out = metadata.annotations[sprintf(\"container.apparmor.security.beta.kubernetes.io/%v\", [container.name])]\n        }\n        get_annotation_for(container, metadata) = out {\n            not metadata.annotations[sprintf(\"container.apparmor.security.beta.kubernetes.io/%v\", [container.name])]\n            out = \"runtime/default\"\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspapparmor]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspallowedusers\n  annotations:\n    metadata.gatekeeper.sh/title: \"Allowed Users\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the user and group IDs of the container and some volumes.\n      Corresponds to the `runAsUser`, `runAsGroup`, `supplementalGroups`, and\n      `fsGroup` fields in a PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#users-and-groups\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAllowedUsers\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the user and group IDs of the container and some volumes.\n            Corresponds to the `runAsUser`, `runAsGroup`, `supplementalGroups`, and\n            `fsGroup` fields in a PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#users-and-groups\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            runAsUser:\n              type: object\n              description: \"Controls which user ID values are allowed in a Pod or container-level SecurityContext.\"\n              properties:\n                rule:\n                  type: string\n                  description: \"A strategy for applying the runAsUser restriction.\"\n                  enum:\n                    - MustRunAs\n                    - MustRunAsNonRoot\n                    - RunAsAny\n                ranges:\n                  type: array\n                  description: \"A list of user ID ranges affected by the rule.\"\n                  items:\n                    type: object\n                    description: \"The range of user IDs affected by the rule.\"\n                    properties:\n                      min:\n                        type: integer\n                        description: \"The minimum user ID in the range, inclusive.\"\n                      max:\n                        type: integer\n                        description: \"The maximum user ID in the range, inclusive.\"\n            runAsGroup:\n              type: object\n              description: \"Controls which group ID values are allowed in a Pod or container-level SecurityContext.\"\n              properties:\n                rule:\n                  type: string\n                  description: \"A strategy for applying the runAsGroup restriction.\"\n                  enum:\n                    - MustRunAs\n                    - MayRunAs\n                    - RunAsAny\n                ranges:\n                  type: array\n                  description: \"A list of group ID ranges affected by the rule.\"\n                  items:\n                    type: object\n                    description: \"The range of group IDs affected by the rule.\"\n                    properties:\n                      min:\n                        type: integer\n                        description: \"The minimum group ID in the range, inclusive.\"\n                      max:\n                        type: integer\n                        description: \"The maximum group ID in the range, inclusive.\"\n            supplementalGroups:\n              type: object\n              description: \"Controls the supplementalGroups values that are allowed in a Pod or container-level SecurityContext.\"\n              properties:\n                rule:\n                  type: string\n                  description: \"A strategy for applying the supplementalGroups restriction.\"\n                  enum:\n                    - MustRunAs\n                    - MayRunAs\n                    - RunAsAny\n                ranges:\n                  type: array\n                  description: \"A list of group ID ranges affected by the rule.\"\n                  items:\n                    type: object\n                    description: \"The range of group IDs affected by the rule.\"\n                    properties:\n                      min:\n                        type: integer\n                        description: \"The minimum group ID in the range, inclusive.\"\n                      max:\n                        type: integer\n                        description: \"The maximum group ID in the range, inclusive.\"\n            fsGroup:\n              type: object\n              description: \"Controls the fsGroup values that are allowed in a Pod or container-level SecurityContext.\"\n              properties:\n                rule:\n                  type: string\n                  description: \"A strategy for applying the fsGroup restriction.\"\n                  enum:\n                    - MustRunAs\n                    - MayRunAs\n                    - RunAsAny\n                ranges:\n                  type: array\n                  description: \"A list of group ID ranges affected by the rule.\"\n                  items:\n                    type: object\n                    description: \"The range of group IDs affected by the rule.\"\n                    properties:\n                      min:\n                        type: integer\n                        description: \"The minimum group ID in the range, inclusive.\"\n                      max:\n                        type: integer\n                        description: \"The maximum group ID in the range, inclusive.\"\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspallowedusers\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg}] {\n          fields := [\"runAsUser\", \"runAsGroup\", \"supplementalGroups\", \"fsGroup\"]\n          field := fields[_]\n          container := input_containers[_]\n          not is_exempt(container)\n          msg := get_type_violation(field, container)\n        }\n\n        get_type_violation(field, container) = msg {\n          field == \"runAsUser\"\n          params := input.parameters[field]\n          msg := get_user_violation(params, container)\n        }\n\n        get_type_violation(field, container) = msg {\n          field != \"runAsUser\"\n          params := input.parameters[field]\n          msg := get_violation(field, params, container)\n        }\n\n        # RunAsUser (separate due to \"MustRunAsNonRoot\")\n        get_user_violation(params, container) = msg {\n          rule := params.rule\n          provided_user := get_field_value(\"runAsUser\", container, input.review)\n          not accept_users(rule, provided_user)\n          msg := sprintf(\"Container %v is attempting to run as disallowed user %v. Allowed runAsUser: %v\", [container.name, provided_user, params])\n        }\n\n        get_user_violation(params, container) = msg {\n          not get_field_value(\"runAsUser\", container, input.review)\n          params.rule = \"MustRunAs\"\n          msg := sprintf(\"Container %v is attempting to run without a required securityContext/runAsUser\", [container.name])\n        }\n\n        get_user_violation(params, container) = msg {\n          params.rule = \"MustRunAsNonRoot\"\n          not get_field_value(\"runAsUser\", container, input.review)\n          not get_field_value(\"runAsNonRoot\", container, input.review)\n          msg := sprintf(\"Container %v is attempting to run without a required securityContext/runAsNonRoot or securityContext/runAsUser != 0\", [container.name])\n        }\n\n        accept_users(\"RunAsAny\", provided_user) {t

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ns\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$\\(REPO_OWNER\\)\",\"--repo\",\"\\$\\(REPO_NAME\\)\",\"-pr\",\"\\$\\(PULL_NUMBER\\)\",\"-sha1\",\"\\$\\(PULL_PULL_SHA\\)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\ -no-color; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -pr \\$\\(PULL_NUMBER\\) -sha1 \\$\\(PULL_PULL_SHA\\)\\\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -sha1 \\$\\(PULL_BASE_SHA\\)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-token]
module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \"eu.gcr.io/kyma-project/test-infra/markdown-index:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/markdown-index\",\"--config=prow\\/markdown-index\\/test-infra-markdown-index-autobump-config\\.yaml\",\"--labels-override=kind\\/chore,area\\/documentation\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/imagedetector\",\"--prow-config=prow\\/config\\.yaml\",\"--prow-jobs-dir=prow\\/jobs\",\"--terraform-dir=configs\\/terraform\",\"--sec-scanner-config=sec-scanners-config\\.yaml\",\"--kubernetes-dir=prow\\/cluster\\/components\",\"--autobump-config=prow\\/image-detector\\/test-infra-sec-config-autobump-config\\.yaml\",\"--inrepo-config=prow\\/image-detector\\/inrepo-config\\.yaml\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: eventing-tools-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=ci\\/eventing-tools-autobump-config\\.yaml\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=prow\\/autobump-config\\/prow-cluster-autobump-config\\.yaml\",\"--labels-override=kind\\/chore,area\\/prow\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=prow\\/autobump-config\\/test-infra-autobump-config\\.yaml\",\"--labels-override=skip-review,area\\/ci,kind\\/chore\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-label-sync\n      - image: \"gcr.io/k8s-prow/label_sync:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"label_sync\",\"--config=\\/etc\\/config\\/labels\\.yaml\",\"--confirm=true\",\"--orgs=kyma-project,kyma-incubator\",\"--token=\\/etc\\/github\\/token\",\"--endpoint=http:\\/\\/ghproxy\",\"--endpoint=https:\\/\\/api\\.github\\.com\",\"--debug\"\\],\"container_name\":\"test\",.*}$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-autobump-bot-github-token]
module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_binding.dns_collector_bucket_get will be created
  + resource "google_project_iam_binding" "dns_collector_bucket_get" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "projects/sap-kyma-prow/roles/BucketGet"
    }

  # google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer will be created
  + resource "google_project_iam_binding" "dns_collector_container_analysis_occurrences_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/containeranalysis.occurrences.viewer"
    }

  # google_project_iam_binding.dns_collector_dns_reader will be created
  + resource "google_project_iam_binding" "dns_collector_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/dns.reader"
    }

  # google_service_account.sa_gke_kyma_integration will be created
  + resource "google_service_account" "sa_gke_kyma_integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE."
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
google_service_account.sa_gke_kyma_integration: Creating...

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource "google_service_account" "sa_gke_kyma_integration":
   3: resource "google_service_account" "sa_gke_kyma_integration" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8250,"Program":"tfcmt","SHA1":"9d874c306ea6fc91f6637f02dfe0c1b1359f3d8e","Vars":{}} -->